In [4]:
import pandas as pd
import numpy as np

In [19]:
# NUEVO DICT CON VALORES NULL Y NONE
dic = {'col1':[1, 2, 3, np.nan],
       'col2':[4, np.nan, 6, 7],
       'col3':['a', 'b', 'c', None]}
df = pd.DataFrame(dic)
df

   col1  col2  col3
0   1.0   4.0     a
1   2.0   NaN     b
2   3.0   6.0     c
3   NaN   7.0  None

In [20]:
# MASCARA BOOLEANA, CON VALORES NULOS
df.isnull()

    col1   col2   col3
0  False  False  False
1  False   True  False
2  False  False  False
3   True  False   True

In [21]:
# MASCARA BOOLEANA CON 0 y 1
df.isnull() * -1

   col1  col2  col3
0     0     0     0
1     0    -1     0
2     0     0     0
3    -1     0    -1

In [22]:
# RELLENA LOS NULL Y NONE CON UN VALOR ESPECIFICO
df.fillna('missing')

      col1     col2     col3
0      1.0      4.0        a
1      2.0  missing        b
2      3.0      6.0        c
3  missing      7.0  missing

In [13]:
# RELLENA LOS VALORES NULL CON LA MEDIA DE LA COLUMNA
# SI LA COLUMNA NO ES NUMERICA, SE MUESTRA UNA ADVERTENCIA
# SE USAR: MEAN, MIN, MAX, PERCENTIL, STR, AVERAGE, MODA, ETC
df.fillna(df.mean())

/tmp/ipykernel_186/1595306501.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean())

   col1      col2  col3
0   1.0  4.000000     a
1   2.0  5.666667     b
2   3.0  6.000000     c
3   2.0  7.000000  None

In [15]:
# INTERPOLA LOS VALORES NULOS
df.interpolate()

   col1  col2  col3
0   1.0   4.0     a
1   2.0   5.0     b
2   3.0   6.0     c
3   3.0   7.0  None

In [17]:
# ELIMINA FILA CON VALORES NULOS
df.dropna()

   col1  col2 col3
0   1.0   4.0    a
2   3.0   6.0    c

In [25]:
# ELIMINA FILA CON DATOS NULL DE UNA COLUMNA ESPECIFICA
df.dropna(subset='col2')

   col1  col2  col3
0   1.0   4.0     a
2   3.0   6.0     c
3   NaN   7.0  None

In [27]:
# SUMA LOS VALORES NULL POR COLUMNA
df.isnull().sum()

col1    1
col2    1
col3    1
dtype: int64

In [28]:
# TRUE SI NO ES NULL
df.notnull()

    col1   col2   col3
0   True   True   True
1   True  False   True
2   True   True   True
3  False   True  False

In [32]:
# SI EXISTEN NULLOS EN CADA COLUMNA
df.isnull().any()

col1    True
col2    True
col3    True
dtype: bool

In [33]:
# COLOCA NaN DONDE EXISTAN VALORES NULL
df[df.notnull()]

   col1  col2 col3
0   1.0   4.0    a
1   2.0   NaN    b
2   3.0   6.0    c
3   NaN   7.0  NaN

In [38]:
# EN SERIE DE TIEMPO, NO ES RECOMENDABLE RELLENAR CON MEDIAS O TEXTOS
# ES MEJOR RELLENAR CON EL VALOR DEL SIGUIENTE O ANTERIOS REGISTRO

# FRONT FILL
df['col1'].fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
Name: col1, dtype: float64

In [39]:
# BACK FILL
df['col1'].fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    NaN
Name: col1, dtype: float64